scripts/UC_2_buyItem/result1/Iteration1/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>JohnDoe1</ns2:safePayUsername><ns2:safePayPassword>aea075793a295b43a1c492a06b04251bbe5f8f1d</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886543210987654</ns2:cardNumber><ns2:expirationDate>122025</ns2:expirationDate><ns2:cvvNumber>256</ns2:cvvNumber><ns2:customerName>John Doe</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>